driver-tests/httpsoapbc/HttpSoapBCTests/HttpSoapBCJbi/test/bankInvokeConcurrent/Input1.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="urn:bank" xmlns:xs="http://www.w3.org/2001/XMLSchema">
   <soap:Body>
      <tns:withdraw>
         <tns:account>5345</tns:account>
         <tns:amount>3245</tns:amount>
      </tns:withdraw>
   </soap:Body>
</soap:Envelope>